In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

Done in SQL 'lab-sql-7'
1. Create a table rentals_may to store the data from rental table with information for the month of May.
2. Insert values in the table rentals_may using the table rental, filtering values only for the month of May.
3. Create a table rentals_june to store the data from rental table with information for the month of June.
4. Insert values in the table rentals_june using the table rental, filtering values only for the month of June.
5. Check the number of rentals for each customer for May.
6. Check the number of rentals for each customer for June.

7. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:
- Check the number of rentals for each customer for May
- Check the number of rentals for each customer for June
Hint: You can store the results from the two queries in two separate dataframes.

8. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.
Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

7. Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy as alch

In [2]:
from getpass import getpass
password = getpass("sql password: ")

sql password: ········

In [3]:
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [4]:
# Checking the engine
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

- Check the number of rentals for each customer for May

In [5]:
query = 'SELECT DISTINCT(customer_id), COUNT(rental_id) AS num_rentals \
FROM rentals_may \
GROUP BY customer_id \
ORDER BY customer_id'

rentals_may_df = pd.read_sql_query(query, engine)
rentals_may_df.head()

   customer_id  num_rentals
0            1            4
1            2            2
2            3            4
3            5            6
4            6            6

In [6]:
len(rentals_may_df)

520

- Check the number of rentals for each customer for June

In [7]:
query = 'SELECT DISTINCT(customer_id), COUNT(rental_id) AS num_rentals \
FROM rentals_june \
GROUP BY customer_id \
ORDER BY customer_id'

rentals_june_df = pd.read_sql_query(query, engine)
rentals_june_df.head()

   customer_id  num_rentals
0            1           14
1            2            2
2            3            8
3            4           12
4            5           10

In [8]:
len(rentals_june_df)

590

8. Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [9]:
merged_rentals_df = pd.merge(
    rentals_may_df,
    rentals_june_df,
    on="customer_id",
    how="inner",
    suffixes=["_may", "_june"]
)

merged_rentals_df.head()

   customer_id  num_rentals_may  num_rentals_june
0            1                4                14
1            2                2                 2
2            3                4                 8
3            5                6                10
4            6                6                 8

In [10]:
merged_rentals_df['May < June'] = merged_rentals_df['num_rentals_may']<merged_rentals_df['num_rentals_june']
merged_rentals_df.head()

   customer_id  num_rentals_may  num_rentals_june  May < June
0            1                4                14        True
1            2                2                 2       False
2            3                4                 8        True
3            5                6                10        True
4            6                6                 8        True

In [11]:
merged_rentals_df['May < June'] = np.where(
    merged_rentals_df['num_rentals_may'] == merged_rentals_df['num_rentals_june'], 
    "Same",
    merged_rentals_df['May < June']
)
merged_rentals_df.head()

   customer_id  num_rentals_may  num_rentals_june May < June
0            1                4                14       True
1            2                2                 2       Same
2            3                4                 8       True
3            5                6                10       True
4            6                6                 8       True